skuep/AIOC/stm32/aioc-fw/Src/usb_audio.c
        TU_LOG2("    Set Mute: %d of channel: %u\r\n", microphoneMute[channelNum], channelNum);
      return true;

      case AUDIO_FU_CTRL_VOLUME:
        // Request uses format layout 2
        TU_VERIFY(p_request->wLength == sizeof(audio_control_cur_2_t));

        microphoneLogVolume[channelNum] = ((audio_control_cur_2_t*) pBuff)->bCur;
        double logVolume = microphoneLogVolume[channelNum] / 256; /* format is 7.8 fixed point */
        microphoneLinVolume[channelNum] = (microphoneLogVolume[channelNum] != 0x8000) ?
                (uint16_t) (65535 * pow(10, logVolume/20) + 0.5) : 0; /* log to linear with rounding */

        settingsRegMap[SETTINGS_REG_INFO_AUDIO3] = ((((uint32_t) microphoneLinVolume[0]) << SETTINGS_REG_INFO_AUDIO3_RECVOL0_OFFS) & SETTINGS_REG_INFO_AUDIO3_RECVOL0_MASK) \
                                               | ((((uint32_t) microphoneLinVolume[1]) << SETTINGS_REG_INFO_AUDIO3_RECVOL1_OFFS) & SETTINGS_REG_INFO_AUDIO3_RECVOL1_MASK);

        TU_LOG2("    Set Volume: %u.%u dB of channel: %u\r\n", microphoneLogVolume[channelNum] / 256, microphoneLogVolume[channelNum] % 256, channelNum);
      return true;

        // Unknown/Unsupported control
      default:
        TU_BREAKPOINT();
      return false;
    }
  }

  if ( entityID == AUDIO_CTRL_ID_SPK_FUNIT )
  {
    switch ( ctrlSel )
    {
      case AUDIO_FU_CTRL_MUTE:
        // Request uses format layout 1
        TU_VERIFY(p_request->wLength == sizeof(audio_control_cur_1_t));

        speakerMute[channelNum] = ((audio_control_cur_1_t*) pBuff)->bCur;

        /* Update debug register */
        settingsRegMap[SETTINGS_REG_INFO_AUDIO0] =  (settingsRegMap[SETTINGS_REG_INFO_AUDIO0] & ~(SETTINGS_REG_INFO_AUDIO0_PLAYMUTE0_MASK | SETTINGS_REG_INFO_AUDIO0_PLAYMUTE1_MASK)) \
                                                | (speakerMute[0] ? SETTINGS_REG_INFO_AUDIO0_PLAYMUTE0_MASK : 0) \
                                                | (speakerMute[1] ? SETTINGS_REG_INFO_AUDIO0_PLAYMUTE1_MASK : 0);

        TU_LOG2("    Set Mute: %d of channel: %u\r\n", speakerMute[channelNum], channelNum);

      return true;

      case AUDIO_FU_CTRL_VOLUME:
        // Request uses format layout 2
        TU_VERIFY(p_request->wLength == sizeof(audio_control_cur_2_t));

        speakerLogVolume[channelNum] = ((audio_control_cur_2_t*) pBuff)->bCur;
        double logVolume = (double) speakerLogVolume[channelNum] / 256; /* format is 7.8 fixed point */
        speakerLinVolume[channelNum] = (speakerLogVolume[channelNum] != 0x8000) ?
                (uint16_t) (65535 * pow(10, logVolume/20) + 0.5) : 0; /* log to linear with rounding */

        /* Update debug register */
        settingsRegMap[SETTINGS_REG_INFO_AUDIO9] = ((((uint32_t) speakerLinVolume[0]) << SETTINGS_REG_INFO_AUDIO9_PLAYVOL0_OFFS) & SETTINGS_REG_INFO_AUDIO9_PLAYVOL0_MASK) \
                                               | ((((uint32_t) speakerLinVolume[1]) << SETTINGS_REG_INFO_AUDIO9_PLAYVOL1_OFFS) & SETTINGS_REG_INFO_AUDIO9_PLAYVOL1_MASK);


        TU_LOG2("    Set Volume: %u.%u dB of channel: %u\r\n", microphoneLogVolume[channelNum] / 256, microphoneLogVolume[channelNum] % 256, channelNum);
      return true;

        // Unknown/Unsupported control
      default:
        TU_BREAKPOINT();
      return false;
    }
  }

  if ( entityID == AUDIO_CTRL_ID_MIC_CLOCK )
  {
    switch ( ctrlSel )
    {
      case AUDIO_CS_CTRL_SAM_FREQ:
        // channelNum is always zero in this case
        switch ( p_request->bRequest )
        {
          case AUDIO_CS_REQ_CUR:
            TU_VERIFY(p_request->wLength == sizeof(audio_control_cur_4_t));
            microphoneSampleFreq = ((audio_control_cur_4_t*) pBuff)->bCur;
            TU_LOG2("    Set Mic. Sample Freq: %lu\r\n", microphoneSampleFreq);


            rational_decimator_reset(&adc_resampler);
            rational_decimator_set_rate(&adc_resampler, ADC_get_sample_rate(), microphoneSampleFreq);
            microphoneSampleFreqCfg = microphoneSampleFreq;

            /* Update debug register */
            settingsRegMap[SETTINGS_REG_INFO_AUDIO2] = (((uint32_t) microphoneSampleFreqCfg) << SETTINGS_REG_INFO_AUDIO2_RECRATE_OFFS) & SETTINGS_REG_INFO_AUDIO2_RECRATE_MASK;

            return true;

          // Unknown/Unsupported control
          default:
            TU_BREAKPOINT();
            return false;
        }
      break;

      // Unknown/Unsupported control
      default:
        TU_BREAKPOINT();
        return false;
    }
  }

  if ( entityID == AUDIO_CTRL_ID_SPK_CLOCK )
  {
    switch ( ctrlSel )
    {
      case AUDIO_CS_CTRL_SAM_FREQ:
        // channelNum is always zero in this case
        switch ( p_request->bRequest )
        {
          case AUDIO_CS_REQ_CUR:
            TU_VERIFY(p_request->wLength == sizeof(audio_control_cur_4_t));
            speakerSampleFreq = ((audio_control_cur_4_t*) pBuff)->bCur;
            TU_LOG2("    Set Spk. Sample Freq: %lu\r\n", speakerSampleFreq);

            rational_interpolator_reset(&dac_resampler);
            rational_interpolator_set_rate(&dac_resampler, speakerSampleFreq, DAC_get_sample_rate());
            /* With rational resampler it is exact*/
            speakerSampleFreqCfg = speakerSampleFreq;

            /* Update debug register */
            settingsRegMap[SETTINGS_REG_INFO_AUDIO8] = (((uint32_t) speakerSampleFreqCfg) << SETTINGS_REG_INFO_AUDIO8_PLAYRATE_OFFS) & SETTINGS_REG_INFO_AUDIO8_PLAYRATE_MASK;

            return true;

          // Unknown/Unsupported control
          default:
            TU_BREAKPOINT();
            return false;
        }
      break;

      // Unknown/Unsupported control
      default:
        TU_BREAKPOINT();
        return false;
    }
  }

  return false;    // Yet not implemented
}

// Invoked when audio class specific get request received for an entity
bool tud_audio_get_req_entity_cb(uint8_t rhport, tusb_control_request_t const * p_request)
{
  (void) rhport;

  // Page 91 in UAC2 specification
  uint8_t channelNum = TU_U16_LOW(p_request->wValue);
  uint8_t ctrlSel = TU_U16_HIGH(p_request->wValue);
  uint8_t itf = TU_U16_LOW(p_request->wIndex);
  uint8_t entityID = TU_U16_HIGH(p_request->wIndex);

  TU_ASSERT(itf == ITF_NUM_AUDIO_CONTROL);

