skuep/AIOC/stm32/aioc-fw/Src/usb_audio.c
  // Input terminal (Microphone input)
  if (entityID == AUDIO_CTRL_ID_MIC_INPUT)
  {
    switch ( ctrlSel )
    {
      case AUDIO_TE_CTRL_CONNECTOR:
      {
        // The terminal connector control only has a get request with only the CUR attribute.
        audio_desc_channel_cluster_t ret;

        // Those are dummy values for now
        ret.bNrChannels = 1;
        ret.bmChannelConfig = 0;
        ret.iChannelNames = 0;

        TU_LOG2("    Get terminal connector\r\n");

        return tud_audio_buffer_and_schedule_control_xfer(rhport, p_request, (void*) &ret, sizeof(ret));
      }
      break;

        // Unknown/Unsupported control selector
      default:
        TU_BREAKPOINT();
        return false;
    }
  }

  // Output terminal (Speaker output)
  if (entityID == AUDIO_CTRL_ID_SPK_OUTPUT)
  {
    switch ( ctrlSel )
    {
      case AUDIO_TE_CTRL_CONNECTOR:
      {
        // The terminal connector control only has a get request with only the CUR attribute.
        audio_desc_channel_cluster_t ret;

        // Those are dummy values for now
        ret.bNrChannels = 1;
        ret.bmChannelConfig = 0;
        ret.iChannelNames = 0;

        TU_LOG2("    Get terminal connector\r\n");

        return tud_audio_buffer_and_schedule_control_xfer(rhport, p_request, (void*) &ret, sizeof(ret));
      }
      break;

        // Unknown/Unsupported control selector
      default:
        TU_BREAKPOINT();
        return false;
    }
  }

  if (entityID == AUDIO_CTRL_ID_SPK_FUNIT)
  {
      switch ( ctrlSel )
      {
        case AUDIO_FU_CTRL_MUTE:
          // Audio control mute cur parameter block consists of only one byte - we thus can send it right away
          // There does not exist a range parameter block for microphoneMute
          TU_LOG2("    Get Mute of channel: %u\r\n", channelNum);
          return tud_control_xfer(rhport, p_request, &speakerMute[channelNum], 1);

        case AUDIO_FU_CTRL_VOLUME:
          switch ( p_request->bRequest )
          {
            case AUDIO_CS_REQ_CUR:
              TU_LOG2("    Get Volume of channel: %u\r\n", channelNum);
              return tud_control_xfer(rhport, p_request, &speakerLogVolume[channelNum], sizeof(speakerLogVolume[channelNum]));

            case AUDIO_CS_REQ_RANGE:
              TU_LOG2("    Get Volume range of channel: %u\r\n", channelNum);

              /* The Volume Control is one of the building blocks of a Feature Unit. A Volume Control must support the
                CUR and RANGE(MIN, MAX, RES) attributes. The settings for the CUR, MIN, and MAX attributes can
                range from +127.9961 dB (0x7FFF) down to -127.9961 dB (0x8001) in steps of 1/256 dB or 0.00390625
                dB (0x0001). The settings for the RES attribute can only have positive values and range from 1/256 dB
                (0x0001) to +127.9961 dB (0x7FFF).
                In addition, code 0x8000, representing silence (i.e., -∞ dB), must always be implemented. However, it
                must never be reported as the MIN attribute value. */

              // Copy values - only for testing - better is version below
              audio_control_range_2_n_t(1) ret;

              /* From 1 (0dB) down to 1/65536 (-96dB) */
              ret.wNumSubRanges = 1;
              ret.subrange[0].bMin = -96 * 256;
              ret.subrange[0].bMax = 0;
              ret.subrange[0].bRes = 1;

              return tud_audio_buffer_and_schedule_control_xfer(rhport, p_request, (void*) &ret, sizeof(ret));

              // Unknown/Unsupported control
            default:
              TU_BREAKPOINT();
              return false;
          }
        break;

          // Unknown/Unsupported control
        default:
          TU_BREAKPOINT();
          return false;
      }
  }

  // Feature unit
  if (entityID == AUDIO_CTRL_ID_MIC_FUNIT)
  {
    switch ( ctrlSel )
    {
      case AUDIO_FU_CTRL_MUTE:
        // Audio control microphoneMute cur parameter block consists of only one byte - we thus can send it right away
        // There does not exist a range parameter block for microphoneMute
        TU_LOG2("    Get Mute of channel: %u\r\n", channelNum);
        return tud_control_xfer(rhport, p_request, &microphoneMute[channelNum], 1);

      case AUDIO_FU_CTRL_VOLUME:
        switch ( p_request->bRequest )
        {
          case AUDIO_CS_REQ_CUR:
            TU_LOG2("    Get Volume of channel: %u\r\n", channelNum);
            return tud_control_xfer(rhport, p_request, &microphoneLogVolume[channelNum], sizeof(microphoneLogVolume[channelNum]));

          case AUDIO_CS_REQ_RANGE:
            TU_LOG2("    Get Volume range of channel: %u\r\n", channelNum);

            /* The Volume Control is one of the building blocks of a Feature Unit. A Volume Control must support the
              CUR and RANGE(MIN, MAX, RES) attributes. The settings for the CUR, MIN, and MAX attributes can
              range from +127.9961 dB (0x7FFF) down to -127.9961 dB (0x8001) in steps of 1/256 dB or 0.00390625
              dB (0x0001). The settings for the RES attribute can only have positive values and range from 1/256 dB
              (0x0001) to +127.9961 dB (0x7FFF).
              In addition, code 0x8000, representing silence (i.e., -∞ dB), must always be implemented. However, it
              must never be reported as the MIN attribute value. */

            // Copy values - only for testing - better is version below
            audio_control_range_2_n_t(1) ret;

            /* From 1 (0dB) down to 1/65536 (-96dB) */
            ret.wNumSubRanges = 1;
            ret.subrange[0].bMin = -96 * 256;
            ret.subrange[0].bMax = 0;
            ret.subrange[0].bRes = 1;

            return tud_audio_buffer_and_schedule_control_xfer(rhport, p_request, (void*) &ret, sizeof(ret));

            // Unknown/Unsupported control
          default:
            TU_BREAKPOINT();
            return false;
        }
      break;

        // Unknown/Unsupported control
      default:
        TU_BREAKPOINT();
        return false;
    }
  }

  // Clock Source unit
  if ( entityID == AUDIO_CTRL_ID_MIC_CLOCK )
  {
    switch ( ctrlSel )
    {
      case AUDIO_CS_CTRL_SAM_FREQ:
        // channelNum is always zero in this case
        switch ( p_request->bRequest )
        {
          case AUDIO_CS_REQ_CUR:
            TU_LOG2("    Get Mic. Sample Freq.\r\n");
            return tud_control_xfer(rhport, p_request, &microphoneSampleFreq, sizeof(microphoneSampleFreq));

          case AUDIO_CS_REQ_RANGE:
            TU_LOG2("    Get Mic. Sample Freq. range\r\n");
            return tud_control_xfer(rhport, p_request, &sampleFreqRng, sizeof(sampleFreqRng));

           // Unknown/Unsupported control
          default:
            TU_BREAKPOINT();
            return false;
        }
      break;

