skuep/AIOC/stm32/aioc-fw/Src/usb_audio.c
    switch (itf) {
    case ITF_NUM_AUDIO_STREAMING_IN:
        /* Microphone channel has been stopped */
        NVIC_DisableIRQ(DMA2_Channel1_IRQn);
        microphoneState = STATE_OFF;

        /* Update debug register */
        settingsRegMap[SETTINGS_REG_INFO_AUDIO0] = (settingsRegMap[SETTINGS_REG_INFO_AUDIO0] & ~SETTINGS_REG_INFO_AUDIO0_RECSTATE_MASK)
                                               | (((uint32_t) SETTINGS_REG_INFO_AUDIO0_RECSTATE_OFF_ENUM) << SETTINGS_REG_INFO_AUDIO0_RECSTATE_OFFS);
        break;

    case ITF_NUM_AUDIO_STREAMING_OUT:
        /* Speaker channel has been stopped */
        NVIC_DisableIRQ(DMA1_Channel3_IRQn);
        speakerState = STATE_OFF;

        /* Update debug register */
        settingsRegMap[SETTINGS_REG_INFO_AUDIO0] = (settingsRegMap[SETTINGS_REG_INFO_AUDIO0] & ~SETTINGS_REG_INFO_AUDIO0_PLAYSTATE_MASK)
                                               | (((uint32_t) SETTINGS_REG_INFO_AUDIO0_PLAYSTATE_OFF_ENUM) << SETTINGS_REG_INFO_AUDIO0_PLAYSTATE_OFFS);
        break;

    default:
        TU_ASSERT(0, false);
        break;
    }

    return true;
}

void tud_audio_feedback_params_cb(uint8_t func_id, uint8_t alt_itf, audio_feedback_params_t* feedback_param)
{
    /* Configure parameters for feedback endpoint */
    feedback_param->frequency.mclk_freq = USB_SOF_TIMER_HZ;
    feedback_param->sample_freq = speakerSampleFreqCfg;
    feedback_param->method = AUDIO_FEEDBACK_METHOD_FREQUENCY_FIXED;
}

bool tud_audio_feedback_format_correction_cb(uint8_t func_id)
{
    /* Use the quirk detection to detect whether we need format correction (10.14) according to the USB specification (MacOS)
     * or whether we use no correction (16.16) as a quirk (Windows). Linux works either way. */
    if (tud_speed_get() == TUSB_SPEED_FULL) {
        return USB_DescUAC2Quirk() ? false : true;
    } else {
        return false;
    }
}

TU_ATTR_FAST_FUNC void tud_audio_feedback_interval_isr(uint8_t func_id, uint32_t frame_number, uint8_t interval_shift)
{
    static uint32_t prev_cycles = 0;
    uint32_t this_cycles = USB_SOF_TIMER_CNT;
    uint32_t feedback;

    /* Calculate number of master clock cycles between now and last call */
    uint32_t cycles = (uint32_t) (((uint64_t) this_cycles - prev_cycles) & 0xFFFFFFFFUL);
    TU_ASSERT(cycles != 0, /**/);
    /* Prepare for next time */
    prev_cycles = this_cycles;

    /* Calculate the feedback value, taken from tinyusb stack */
    uint64_t fb64 = (((uint64_t) cycles) * speakerSampleFreqCfg) << 16;
    feedback = (uint32_t) (fb64 / USB_SOF_TIMER_HZ);

    /* Couple the buffer level bias to the feedback value to avoid buffer drift */
    if (speakerState == STATE_RUN) {
        int32_t bias = (int32_t) speakerBufferLvlAvg - ((int32_t) SPEAKER_BUFFERLVL_TARGET << 16); /* 16.16 format same as feedback */
        feedback -= ((int64_t) bias * SPEAKER_BUFLVL_FB_COUPLING) / 65536;
    }

    /* The size of isochronous packets created by the device must be within the limits specified in FMT-2.0 section 2.3.1.1.
     * This means that the deviation of actual packet size from nominal size must not exceed +/- one audio slot
     * (audio slot = channel count samples). */
    uint32_t sampleFreq = speakerSampleFreq;
    uint32_t min_value = (sampleFreq/1000 - 1) << 16; /* 1000 for full-speed USB */
    uint32_t max_value = (sampleFreq/1000 + 1) << 16;

    /* Limit */
    if ( feedback > max_value ) feedback = max_value;
    if ( feedback < min_value ) feedback = min_value;

    /* Send to host */
    tud_audio_n_fb_set(func_id, feedback);

    /* Handle min/max/avg statistics */
    if (feedback < speakerFeedbackMin) speakerFeedbackMin = feedback;
    if (feedback > speakerFeedbackMax) speakerFeedbackMax = feedback;
    speakerFeedbackAvg = (speakerFeedbackAvg * (65536 - SPEAKER_FEEDBACK_AVG) + ((uint64_t) feedback << 16) * SPEAKER_FEEDBACK_AVG) / 65536.0;

    if (speakerState == STATE_START) {
        /* Initialize/overwrite min/max/avg during start */
        speakerFeedbackAvg = (uint64_t) feedback << 16;
        speakerFeedbackMin = feedback;
        speakerFeedbackMax = feedback;
    }

    /* Write to debug registers */
    settingsRegMap[SETTINGS_REG_INFO_AUDIO13] = ((uint32_t) (speakerFeedbackAvg >> 16) << SETTINGS_REG_INFO_AUDIO13_PLAYFBAVG_OFFS) & SETTINGS_REG_INFO_AUDIO13_PLAYFBAVG_MASK;
    settingsRegMap[SETTINGS_REG_INFO_AUDIO14] = ((uint32_t) speakerFeedbackMin         << SETTINGS_REG_INFO_AUDIO14_PLAYFBMIN_OFFS) & SETTINGS_REG_INFO_AUDIO14_PLAYFBMIN_MASK;
    settingsRegMap[SETTINGS_REG_INFO_AUDIO15] = ((uint32_t) speakerFeedbackMax         << SETTINGS_REG_INFO_AUDIO15_PLAYFBMAX_OFFS) & SETTINGS_REG_INFO_AUDIO15_PLAYFBMAX_MASK;
}

uint32_t DAC_get_next_sample(void)
{
    int16_t sample = 0x0000;

    /* Read from FIFO, leave sample at 0 if fifo empty */
    tud_audio_read(&sample, sizeof(sample));

    /* Automatic PTT */
    uint16_t pttThreshold = (settingsRegMap[SETTINGS_REG_VPTT_LVLCTRL] & SETTINGS_REG_VPTT_LVLCTRL_THRSHLD_MASK) >> SETTINGS_REG_VPTT_LVLCTRL_THRSHLD_OFFS;

    if (!speakerMute[1] && ( (sample > pttThreshold) || (sample < -pttThreshold) )) {
        /* Reset timeout and make sure timer is enabled */
        TIM16->EGR = TIM_EGR_UG; /* Generate an update event in the timer */
    }

    /* Get volume */
    uint16_t volume = !speakerMute[1] ? speakerLinVolume[1] : 0;

    /* Scale with 16-bit unsigned volume and round */
    sample = (int16_t) (((int32_t) sample * volume + (sample > 0 ? 32768 : -32768)) / 65536);

    /* Load DAC holding register with sample */
    return ((int32_t) sample + 32768) & 0xFFFFU;
}

void TIM16_IRQHandler(void)
{
    /* This is a timeout counter for the automatic PTT function */
    uint32_t flags = TIM16->SR;

    if (flags & TIM_SR_UIF) {
        /* Timer was reset (via the EGR register). */
        uint32_t cr = TIM16->CR1;
        if (!(cr & TIM_CR1_CEN)) {
            /* If timer was not enabled previously, enable timer and assert PTT */
            TIM16->CR1 = cr | TIM_CR1_CEN;

            /* Update debug register */
            settingsRegMap[SETTINGS_REG_INFO_AUDIO0] |= SETTINGS_REG_INFO_AIOC0_VPTTSTATE_MASK;

            /* Assert enabled PTTs */
            uint8_t pttMask = IO_PTT_MASK_NONE;
            pttMask |= settingsRegMap[SETTINGS_REG_AIOC_IOMUX0] & SETTINGS_REG_AIOC_IOMUX0_OUT1SRC_VPTT_MASK ? IO_PTT_MASK_PTT1 : 0;
            pttMask |= settingsRegMap[SETTINGS_REG_AIOC_IOMUX1] & SETTINGS_REG_AIOC_IOMUX1_OUT2SRC_VPTT_MASK ? IO_PTT_MASK_PTT2 : 0;

            IO_PTTAssert(pttMask);
        }
    } else if (flags & TIM_SR_CC1IF) {
        /* The idle timeout (without any action on the DAC) was reached. Disable timer and deassert PTT */
        TIM16->CR1 &= ~TIM_CR1_CEN;

        /* Update debug register */
        settingsRegMap[SETTINGS_REG_INFO_AUDIO0] &= ~SETTINGS_REG_INFO_AIOC0_VPTTSTATE_MASK;

