skuep/AIOC/stm32/aioc-fw/Src/usb_audio.c
        /* Deassert enabled PTTs */
        uint8_t pttMask = IO_PTT_MASK_NONE;
        pttMask |= settingsRegMap[SETTINGS_REG_AIOC_IOMUX0] & SETTINGS_REG_AIOC_IOMUX0_OUT1SRC_VPTT_MASK ? IO_PTT_MASK_PTT1 : 0;
        pttMask |= settingsRegMap[SETTINGS_REG_AIOC_IOMUX1] & SETTINGS_REG_AIOC_IOMUX1_OUT2SRC_VPTT_MASK ? IO_PTT_MASK_PTT2 : 0;

        IO_PTTDeassert(pttMask);
    }

    TIM16->SR = ~flags;
}

void TIM17_IRQHandler(void)
{
    /* This is a timeout counter for the automatic COS function */
    uint32_t flags = TIM17->SR;

    if (flags & TIM_SR_UIF) {
        /* Timer was reset (via the EGR register). */
        uint32_t cr = TIM17->CR1;
        if (!(cr & TIM_CR1_CEN)) {
            /* If timer was not enabled previously, enable timer and notify host of COS */
            TIM17->CR1 = cr | TIM_CR1_CEN;

            /* Update debug register */
            settingsRegMap[SETTINGS_REG_INFO_AUDIO0] |= SETTINGS_REG_INFO_AIOC0_VCOSSTATE_MASK;

            /* Set COS state */
            COS_VirtualSetState(0x01);
        }
    } else if (flags & TIM_SR_CC1IF) {
        /* The idle timeout (without any action on the ADC) was reached. Disable timer and notify host */
        TIM17->CR1 &= ~TIM_CR1_CEN;

        /* Update debug register */
        settingsRegMap[SETTINGS_REG_INFO_AUDIO0] &= ~SETTINGS_REG_INFO_AIOC0_VCOSSTATE_MASK;

        /* Set COS state */
        COS_VirtualSetState(0x00);
    }

    TIM17->SR = ~flags;
}

static void GPIO_Init(void)
{
    __HAL_RCC_GPIOB_CLK_ENABLE();

    GPIO_InitTypeDef ADCInGpio;
    ADCInGpio.Pin = GPIO_PIN_2;
    ADCInGpio.Mode = GPIO_MODE_ANALOG;
    ADCInGpio.Pull = GPIO_NOPULL;
    ADCInGpio.Speed = GPIO_SPEED_FREQ_LOW;
    ADCInGpio.Alternate = 0;
    HAL_GPIO_Init(GPIOB, &ADCInGpio);

    GPIO_InitTypeDef SamplerateGpio;
    SamplerateGpio.Pin = GPIO_PIN_0;
    SamplerateGpio.Mode = GPIO_MODE_AF_PP;
    SamplerateGpio.Pull = GPIO_NOPULL;
    SamplerateGpio.Speed = GPIO_SPEED_FREQ_HIGH;
    SamplerateGpio.Alternate = GPIO_AF2_TIM3;
    HAL_GPIO_Init(GPIOB, &SamplerateGpio);

    GPIO_InitTypeDef DACOutGpio;
    DACOutGpio.Pin = GPIO_PIN_4;
    DACOutGpio.Mode = GPIO_MODE_ANALOG;
    DACOutGpio.Pull = GPIO_NOPULL;
    DACOutGpio.Speed = GPIO_SPEED_FREQ_LOW;
    DACOutGpio.Alternate = 0;
    HAL_GPIO_Init(GPIOA, &DACOutGpio);
}

static void Timer_DAC_Init(void)
{
    /* Enable clock and (re-) initialize timer */
    __HAL_RCC_TIM6_CLK_ENABLE();

    /* TIM6_TRGO triggers DAC */
    TIM6->CR1 &= ~TIM_CR1_CEN;
    TIM6->CR1 = TIM_CLOCKDIVISION_DIV1 | TIM_COUNTERMODE_UP | TIM_AUTORELOAD_PRELOAD_ENABLE;
    TIM6->CR2 = TIM_TRGO_UPDATE;
    TIM6->PSC = 0;
    TIM6->ARR = DAC_CLOCK_DIVIDER - 1;
    TIM6->EGR = TIM_EGR_UG;

    TIM6->CR1 |= TIM_CR1_CEN;
}

static void ADC_process_samples(uint16_t* buf) {
    uint32_t samples = rational_decimator_process_block_u16(&adc_resampler, buf, ADC_BUFFER_LEN/2);
    uint32_t* output_buffer = rational_decimator_get_outputs(&adc_resampler);

    for(int i = 0;i < samples;i++) {
        /* Get ADC sample */
        int32_t scaled_sample = rational_decimator_scale(&adc_resampler, output_buffer[i] * 16);
        int16_t sample = (scaled_sample - 32768) & 0xFFFFU;

        /* Automatic COS */
        uint16_t cosThreshold = (settingsRegMap[SETTINGS_REG_VCOS_LVLCTRL] & SETTINGS_REG_VCOS_LVLCTRL_THRSHLD_MASK) >> SETTINGS_REG_VCOS_LVLCTRL_THRSHLD_OFFS;

        if (!microphoneMute[1] && ( (sample > cosThreshold) || (sample < -cosThreshold) )) {
            /* Reset timeout and make sure timer is enabled */
            TIM17->EGR = TIM_EGR_UG; /* Generate an update event in the timer */
        }

        /* Get volume */
        uint16_t volume = !microphoneMute[1] ? microphoneLinVolume[1] : 0;

        /* Scale with 16-bit unsigned volume and round */
        sample = (int16_t) (((int32_t) sample * volume + (sample > 0 ? 32768 : -32768)) / 65536);

        /* Store in FIFO */
        tud_audio_write (&sample, sizeof(sample));
    }
}

void DMA2_Channel1_IRQHandler(void) {
    /* Half buffer interrupt, process first half */
    if(DMA2->ISR & DMA_ISR_HTIF1) {
        DMA2->IFCR = DMA_IFCR_CHTIF1;
        ADC_process_samples(ADC_samples);
    }
    /* Full buffer interrupt, process second half */
    if(DMA2->ISR & DMA_ISR_TCIF1) {
        DMA2->IFCR = DMA_IFCR_CTCIF1;
        ADC_process_samples(&ADC_samples[ADC_BUFFER_LEN/2]);
    }
    /* DMA Error, reinit ADC */
    if(DMA2->ISR & DMA_ISR_TEIF1) {
        DMA2->IFCR = DMA_IFCR_CTEIF1;
        DAC_Init();
    }
}

static void ADC_Init(void)
{

    /* Set ADC clock divisor */
    RCC->CFGR2 |= RCC_CFGR2_ADCPRE12_DIV2;

    for (uint32_t i=0; i<100; i++) {
        asm volatile ("nop");
    }

    __HAL_RCC_ADC2_CLK_ENABLE();
    __HAL_RCC_DMA2_CLK_ENABLE();

    ADC2->CR = 0x00 << ADC_CR_ADVREGEN_Pos;
    ADC2->CR = 0x01 << ADC_CR_ADVREGEN_Pos;

    for (uint32_t i=0; i<720; i++) {
        asm volatile ("nop");
    }

    /* Select AHB clock */
    ADC12_COMMON->CCR = (0 << ADC12_CCR_CKMODE_Pos) | (0x00 << ADC12_CCR_MULTI_Pos);

    ADC2->CR |= ADC_CR_ADCAL;

    while (ADC2->CR & ADC_CR_ADCAL)
        ;

    ADC2->CR |= ADC_CR_ADEN;

    /* Wait for ADC to be ready */
    while (!(ADC2->ISR & ADC_ISR_ADRDY))
        ;

    /* Disable DMA */
    DMA2_Channel1->CCR &= ~DMA_CCR_EN;

    /* Enable peripheral to memory from ADC2 */
    DMA2_Channel1->CCR = (0x3 << DMA_CCR_PL_Pos)/* High priority */
                       | (0x1 << DMA_CCR_MSIZE_Pos) /* 16 bits */
                       | (0x1 << DMA_CCR_PSIZE_Pos) /* 16 bits */
                       | (DMA_CCR_MINC) /* Memory increment mode */
                       | (DMA_CCR_CIRC) /* Circular mode */
                       | (DMA_CCR_TEIE) /* Enable error interrupt */
                       | (DMA_CCR_HTIE) /* Enable half buffer interrupt */
                       | (DMA_CCR_TCIE); /* Enable full buffer interrupt */

    /* Buffer length */
    DMA2_Channel1->CNDTR = ADC_BUFFER_LEN;

    /* ADC conversion result source */
    DMA2_Channel1->CPAR = (uint32_t)&ADC2->DR;

